---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionData.ScaledExtrusionLength
source: html/9da555cb-335e-05b0-fb59-e57b5dad9fbd.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionData.ScaledExtrusionLength Property

The length of the extrusion, scaled in the units of the export.

## Syntax (C#)
```csharp
public double ScaledExtrusionLength { get; set; }
```